# [作業目標]

1. 根據題目給的 DataFrame 完成下列操作：

```
- 計算每個不同種類 animal 的 age 的平均數
- 計算每個不同種類 animal 的 age 的平均數
- 將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序
- 將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False
```


2. 一個包含兩個欄位的 DataFrame，將每個數字減去

```
* 1) 該欄位的平均數
* 2) 該筆資料平均數
```

3. 承上題，請問：

```
* 1) 哪一比的資料總合最小
* 2) 哪一欄位的資料總合最小
```

# 作業

### 1. 根據題目給的 DataFrame 完成下列操作：

```
- 計算每個不同種類 animal 的 age 的平均數
- 將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序
- 將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False
```

In [2]:
# 記得先 Import 正確的套件

import numpy as np
import pandas as pd

In [58]:
data = {
    'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
    'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
    'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']
}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(data, index=labels)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [59]:
df["age"].mean

<bound method NDFrame._add_numeric_operations.<locals>.mean of a    2.5
b    3.0
c    0.5
d    NaN
e    5.0
f    2.0
g    4.5
h    NaN
i    7.0
j    3.0
Name: age, dtype: float64>

In [11]:
for i in df.animal.unique():
    print(f"{i}: {df[df['animal'] == i]['age'].mean()}")

cat: 2.5
snake: 2.5
dog: 5.0

In [12]:
df.sort_values(["age", "visits"], ascending=False)

  animal  age  visits priority
i    dog  7.0       2       no
e    dog  5.0       2       no
g  snake  4.5       1       no
b    cat  3.0       3      yes
j    dog  3.0       1       no
a    cat  2.5       1      yes
f    cat  2.0       3       no
c  snake  0.5       2       no
d    dog  NaN       3      yes
h    cat  NaN       1      yes

In [18]:
df.loc[df["priority"] == "yes", "priority"] = True
df.loc[df["priority"] == "no", "priority"] = False
df

  animal  age  visits priority
a    cat  2.5       1     True
b    cat  3.0       3     True
c  snake  0.5       2    False
d    dog  NaN       3     True
e    dog  5.0       2    False
f    cat  2.0       3    False
g  snake  4.5       1    False
h    cat  NaN       1     True
i    dog  7.0       2    False
j    dog  3.0       1    False

### 2. 一個包含兩個欄位的 DataFrame，將每個數字減去

* 1) 該欄位的平均數
* 2) 該筆資料平均數

In [3]:
df = pd.DataFrame(np.random.random(size=(5, 3)))
df

          0         1         2
0  0.271121  0.508241  0.705032
1  0.601111  0.293424  0.069647
2  0.581088  0.188231  0.381177
3  0.584603  0.258434  0.363178
4  0.665167  0.830018  0.141804

In [4]:
df - df.mean()

          0         1         2
0 -0.269497  0.092571  0.372864
1  0.060493 -0.122246 -0.262521
2  0.040470 -0.227438  0.049010
3  0.043985 -0.157235  0.031010
4  0.124550  0.414349 -0.190363

In [5]:
df.sub(df.mean(axis=1), axis=0)

          0         1         2
0 -0.223677  0.013443  0.210234
1  0.279717 -0.027970 -0.251747
2  0.197589 -0.195268 -0.002321
3  0.182531 -0.143637 -0.038894
4  0.119504  0.284355 -0.403859

### 3. 承上題，請問：

1) 哪一筆的資料總合最小
2) 哪一欄位的資料總合最小

In [21]:
df.sum(axis=1).argmin()

1

In [19]:
df.sum().argmin()

2